In [1]:
import pandas as pd

In [6]:
airports = pd.DataFrame([
                        ['Seatte-Tacoma', 'Seattle', 'USA'],
                        ['Dulles', 'Washington', 'USA'],
                        ['Heathrow', 'London', 'United Kingdom'],
                        ['Schiphol', 'Amsterdam', 'Netherlands'],
                        ['Changi', 'Singapore', 'Singapore'],
                        ['Pearson', 'Toronto', 'Canada'],
                        ['Narita', 'Tokyo', 'Japan']
                        ],
                        columns = ['Name', 'City', 'Country']
                    )

airports

            Name        City         Country
0  Seatte-Tacoma     Seattle             USA
1         Dulles  Washington             USA
2       Heathrow      London  United Kingdom
3       Schiphol   Amsterdam     Netherlands
4         Changi   Singapore       Singapore
5        Pearson     Toronto          Canada
6         Narita       Tokyo           Japan

### one column

In [11]:
airports['City']

0       Seattle
1    Washington
2        London
3     Amsterdam
4     Singapore
5       Toronto
6         Tokyo
Name: City, dtype: object

### multiple columns

In [12]:
airports[["City", "Country"]]

         City         Country
0     Seattle             USA
1  Washington             USA
2      London  United Kingdom
3   Amsterdam     Netherlands
4   Singapore       Singapore
5     Toronto          Canada
6       Tokyo           Japan

## iloc for specific rows and columns

In [14]:
airports.iloc[0,0]

'Seatte-Tacoma'

In [16]:
airports.iloc[2,2]

'United Kingdom'

### Range

In [17]:
airports.iloc[:,:]

            Name        City         Country
0  Seatte-Tacoma     Seattle             USA
1         Dulles  Washington             USA
2       Heathrow      London  United Kingdom
3       Schiphol   Amsterdam     Netherlands
4         Changi   Singapore       Singapore
5        Pearson     Toronto          Canada
6         Narita       Tokyo           Japan

In [26]:
airports.iloc[0:2,:]

            Name        City Country
0  Seatte-Tacoma     Seattle     USA
1         Dulles  Washington     USA

In [27]:
airports.iloc[5:, :]

      Name     City Country
5  Pearson  Toronto  Canada
6   Narita    Tokyo   Japan

In [29]:
airports.iloc[3:5, 1:]

        City      Country
3  Amsterdam  Netherlands
4  Singapore    Singapore

### Individual columns

In [22]:
airports.iloc[:, [0,2]]

            Name         Country
0  Seatte-Tacoma             USA
1         Dulles             USA
2       Heathrow  United Kingdom
3       Schiphol     Netherlands
4         Changi       Singapore
5        Pearson          Canada
6         Narita           Japan

### Using loc by names

In [30]:
airports.loc[:, ["Name", "Country"]]

            Name         Country
0  Seatte-Tacoma             USA
1         Dulles             USA
2       Heathrow  United Kingdom
3       Schiphol     Netherlands
4         Changi       Singapore
5        Pearson          Canada
6         Narita           Japan